projects/writing/anime/2022_summer_post/index.org
* Summer 2022 Reviews
** OP
Howdy,

Why did the me from several months ago spend time looking up cowboys? Not sure. Um, here are my reviews for the summer season.

** Frank Boardman "Pistol Pete" Eaton
*** Summertime Render
Just have to get a couple things out of the way up top. First, I'd already read the manga by the time I watched most of these episodes (started them both at around the same time but read through the manga first and then caught up with the anime as it finished airing). As a result, most of my review will focus on the anime-specific parts of the series. Second, when I mentioned that I was doing a little scavenger hunt watching this, you'd suggested that I was keeping an eye out for which characters were shadows. That was a good guess, but not quite. While watching the first episode, I thought there were a lot of visual motifs with light and camera effects, so I was collecting examples of that. It was fun to speculate about what would last through the series as opposed to just being the quirk of a particular episode's director. And there was one thing I only noticed well into the series and then ended up thoroughly confused with by the end. These are all fairly disconnected, so I'll just list them out: (just to be clear, all these links have spoiler material in them)

 - Reflections: For a show that deals with impersonation, this felt like a fairly route one visual metaphor. But despite being introduced in the very [[https://imgur.com/a/0YUXZML][first episode]], it didn't reoccur as often as I'd [[https://imgur.com/a/z6oOj6R][hoped]].

 - Shadows: "This is a show about evil shadows, of course they have shadows in it." Yeah, I agree but I'm referring to [[https://imgur.com/a/owbEOi5][storytelling shadows]].

 - Bokeh: Did you know that bokeh came from the Japanese "boke" meaning haze or blur? Me neither. Don't think that etymology matters, but the show sure used a [[https://imgur.com/a/7bpQ5Ag][lot of it]].

 - Eye reflections: This is the one I didn't cotton onto for a while, and when I did it was more for the intensity it had in that particular [[https://imgur.com/a/Pf2HSuv][instance]]. But then I started to form this theory that the two dominant eye reflection types in the show: (1) big circle at the top with little ovals towards the middle and (2) just two little ovals towards the middle, might have some meaning. Maybe the good guys have type 1 and the baddies have type 2 (and Shinpei having both in episode five was due to him having Haine's evil eye?). By the end of the series I don't think I can stand by that hypothesis, but it was fun to [[https://imgur.com/a/a1MYjZa][look out for]].

 - Blur: There were a lot of instances of characters being stricken by some information and getting a close-up of their reaction where the camera wiggles around and [[https://imgur.com/a/5bhmTlc][blurs]] in and out. There were so many examples of this in the last few episodes that I just gave up screenshotting them.

 - Miscellany: These either appeared too [[https://imgur.com/a/ayvaXhQ][infrequently/inconsequentially]] (as far as I could tell) or appeared in a single episode and therefore felt more like that episode director's personal [[https://imgur.com/a/INyJuOy][quirks]] than a series-wide choice.

8/10 Best explanation for why one of the characters is wearing a bathing suit throughout the series for Ushio's "I can fight in it"

*** Ao Ashi
I definitely enjoyed this adaptation, but that's more due to: (a) my liking the source material and (b) occasional bright spots of animation or emotional climax. That is to say, there were big chunks of this show that were not fun. But that is only relative to other anime that I would normally choose to sit through 24 episodes of. In comparison to other sports anime, or to other soccer anime specifically, this was good.

There were a couple of fun animation thing-ama-jigs that I watched for. The use of rotoscoping, which I think first appeared in episode two with a scene of Ashito turning, was sort of sprinkled through the first cour. And it featured quite heavily in the second cour's opening, but not so much in the actual episodes. In return, the animation quality during the second cour took a step up (in general, cause there were also plenty of extended still shots and cop outs). It felt like there were a few animator favorite characters - Togashi, Yoshitsune and Kaneda - who got a disproportionately high level of movement quality. Maybe someone at Production I.G. just loves the lanky bigboys?

7/10 Most Physics-Defying Animation for the CG soccer ball that never changed size as it moved towards the camera

*** Onipan
Since you seemed surprised that I was actually watching this, I have resolved myself to wholeheartedly defend this show. It's a show about young people, sorry, oni (onii? onieces? onipodes?) trying to change the Japanese peoples' perception of oni. They demonstrate remarkable ingenuity, bravery, and pure-heartedness to overcome every obstacle in their way to make Japan a more openminded place.

Is what I would say if this was a kids show. Which I guess it is, but a Japanese kids show from Wit Studio who seem to have allowed the production to have all the hallmarks of a children's show (long...pauses...in...the...dialogues, bright colors, bite-sized episodic plots) but with some treats thrown in for a dweeb like me.

That's not to say this is a great show, or even particularly good. It just had enough morsels of interest spread throughout to keep me watching. The comedic animation could be quite good, with fun [[https://imgur.com/a/jRpF203][smears]] and reaction [[https://imgur.com/a/NXjcIdT][shots]]. Most episodes that weren't contributing towards the series plot took the form of a parody, from battle towers, to [[https://imgur.com/a/FmEnIuv][Yu-Gi-Oh]], to [[https://imgur.com/a/rk0hfvS][idols]], to [[https://imgur.com/a/QRzw0vv][youtubers]]. And the sense of humor, while usually not my thing, could be amusingly [[https://imgur.com/a/I7LjPqS][self-aware]], [[https://imgur.com/a/bUGsvLg][dark]], or over the top.

6/10 Most surprisingly well-animated fight scene for episode 7's [[https://imgur.com/a/0f4Y4iK][sea battle]]

