projects/writing/anime/2022_summer_post/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-20 Thu 17:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Eric" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4140341">1. Summer 2022 Reviews</a>
<ul>
<li><a href="#orgb3cae99">1.1. OP</a></li>
<li><a href="#org1b606ba">1.2. Frank Boardman "Pistol Pete" Eaton</a>
<ul>
<li><a href="#orgf16df61">1.2.1. Summertime Render</a></li>
<li><a href="#org3cf13ce">1.2.2. Ao Ashi</a></li>
<li><a href="#orgf1f6dbf">1.2.3. Onipan</a></li>
</ul>
</li>
<li><a href="#orgaa05c4e">1.3. William Frederick "Buffalo Bill" Cody</a>
<ul>
<li><a href="#org960f58a">1.3.1. Overlord IV</a></li>
<li><a href="#orgfc65c99">1.3.2. Danmachi IV</a></li>
<li><a href="#orge8a932f">1.3.3. MADE IN ABYSS</a></li>
</ul>
</li>
<li><a href="#orgb807410">1.4. Charlie Siringo</a>
<ul>
<li><a href="#orgb239037">1.4.1. Isekai Ojisan</a></li>
<li><a href="#orgd8f846e">1.4.2. Lycoris Recoil</a></li>
<li><a href="#org616d22a">1.4.3. Bucchigire!</a></li>
<li><a href="#org35a2758">1.4.4. Warau Arsnotoria Sun&#x2013;!</a></li>
<li><a href="#orga7581b7">1.4.5. Yurei Deco</a></li>
<li><a href="#orgb95a3fa">1.4.6. KJ File</a></li>
</ul>
</li>
<li><a href="#org1ed7b6c">1.5. Theodore Roosevelt + Whatever I didn't write about before the season but ended up watching</a>
<ul>
<li><a href="#org52d4244">1.5.1. Hoshi no Samidare</a></li>
<li><a href="#org82c2f29">1.5.2. Musashino</a></li>
<li><a href="#org8795f39">1.5.3. Fuuto Tantei</a></li>
<li><a href="#orgf834961">1.5.4. Cyberpunk Edgerunners</a></li>
</ul>
</li>
<li><a href="#orgd59ebd5">1.6. ED</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org4140341" class="outline-2">
<h2 id="org4140341"><span class="section-number-2">1</span> Summer 2022 Reviews</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgb3cae99" class="outline-3">
<h3 id="orgb3cae99"><span class="section-number-3">1.1</span> OP</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Howdy,
</p>

<p>
Why did the me from several months ago spend time looking up cowboys? Not sure. Um, here are my reviews for the summer season.
</p>
</div>
</div>

<div id="outline-container-org1b606ba" class="outline-3">
<h3 id="org1b606ba"><span class="section-number-3">1.2</span> Frank Boardman "Pistol Pete" Eaton</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgf16df61" class="outline-4">
<h4 id="orgf16df61"><span class="section-number-4">1.2.1</span> Summertime Render</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Just have to get a couple things out of the way up top. First, I'd already read the manga by the time I watched most of these episodes (started them both at around the same time but read through the manga first and then caught up with the anime as it finished airing). As a result, most of my review will focus on the anime-specific parts of the series. Second, when I mentioned that I was doing a little scavenger hunt watching this, you'd suggested that I was keeping an eye out for which characters were shadows. That was a good guess, but not quite. While watching the first episode, I thought there were a lot of visual motifs with light and camera effects, so I was collecting examples of that. It was fun to speculate about what would last through the series as opposed to just being the quirk of a particular episode's director. And there was one thing I only noticed well into the series and then ended up thoroughly confused with by the end. These are all fairly disconnected, so I'll just list them out: (just to be clear, all these links have spoiler material in them)
</p>

<ul class="org-ul">
<li>Reflections: For a show that deals with impersonation, this felt like a fairly route one visual metaphor. But despite being introduced in the very <a href="https://imgur.com/a/0YUXZML">first episode</a>, it didn't reoccur as often as I'd <a href="https://imgur.com/a/z6oOj6R">hoped</a>.</li>

<li>Shadows: "This is a show about evil shadows, of course they have shadows in it." Yeah, I agree but I'm referring to <a href="https://imgur.com/a/owbEOi5">storytelling shadows</a>.</li>

<li>Bokeh: Did you know that bokeh came from the Japanese "boke" meaning haze or blur? Me neither. Don't think that etymology matters, but the show sure used a <a href="https://imgur.com/a/7bpQ5Ag">lot of it</a>.</li>

<li>Eye reflections: This is the one I didn't cotton onto for a while, and when I did it was more for the intensity it had in that particular <a href="https://imgur.com/a/Pf2HSuv">instance</a>. But then I started to form this theory that the two dominant eye reflection types in the show: (1) big circle at the top with little ovals towards the middle and (2) just two little ovals towards the middle, might have some meaning. Maybe the good guys have type 1 and the baddies have type 2 (and Shinpei having both in episode five was due to him having Haine's evil eye?). By the end of the series I don't think I can stand by that hypothesis, but it was fun to <a href="https://imgur.com/a/a1MYjZa">look out for</a>.</li>

<li>Blur: There were a lot of instances of characters being stricken by some information and getting a close-up of their reaction where the camera wiggles around and <a href="https://imgur.com/a/5bhmTlc">blurs</a> in and out. There were so many examples of this in the last few episodes that I just gave up screenshotting them.</li>

<li>Miscellany: These either appeared too <a href="https://imgur.com/a/ayvaXhQ">infrequently/inconsequentially</a> (as far as I could tell) or appeared in a single episode and therefore felt more like that episode director's personal <a href="https://imgur.com/a/INyJuOy">quirks</a> than a series-wide choice.</li>
</ul>

<p>
8/10 Best explanation for why one of the characters is wearing a bathing suit throughout the series for Ushio's "I can fight in it"
</p>
</div>
</div>

<div id="outline-container-org3cf13ce" class="outline-4">
<h4 id="org3cf13ce"><span class="section-number-4">1.2.2</span> Ao Ashi</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
I definitely enjoyed this adaptation, but that's more due to: (a) my liking the source material and (b) occasional bright spots of animation or emotional climax. That is to say, there were big chunks of this show that were not fun. But that is only relative to other anime that I would normally choose to sit through 24 episodes of. In comparison to other sports anime, or to other soccer anime specifically, this was good.
</p>

<p>
There were a couple of fun animation thing-ama-jigs that I watched for. The use of rotoscoping, which I think first appeared in episode two with a scene of Ashito turning, was sort of sprinkled through the first cour. And it featured quite heavily in the second cour's opening, but not so much in the actual episodes. In return, the animation quality during the second cour took a step up (in general, cause there were also plenty of extended still shots and cop outs). It felt like there were a few animator favorite characters - Togashi, Yoshitsune and Kaneda - who got a disproportionately high level of movement quality. Maybe someone at Production I.G. just loves the lanky bigboys?
</p>

<p>
7/10 Most Physics-Defying Animation for the CG soccer ball that never changed size as it moved towards the camera
</p>
</div>
</div>

<div id="outline-container-orgf1f6dbf" class="outline-4">
<h4 id="orgf1f6dbf"><span class="section-number-4">1.2.3</span> Onipan</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Since you seemed surprised that I was actually watching this, I have resolved myself to wholeheartedly defend this show. It's a show about young people, sorry, oni (onii? onieces? onipodes?) trying to change the Japanese peoples' perception of oni. They demonstrate remarkable ingenuity, bravery, and pure-heartedness to overcome every obstacle in their way to make Japan a more openminded place.
</p>

<p>
Is what I would say if this was a kids show. Which I guess it is, but a Japanese kids show from Wit Studio who seem to have allowed the production to have all the hallmarks of a children's show (long&#x2026;pauses&#x2026;in&#x2026;the&#x2026;dialogues, bright colors, bite-sized episodic plots) but with some treats thrown in for a dweeb like me.
</p>

<p>
That's not to say this is a great show, or even particularly good. It just had enough morsels of interest spread throughout to keep me watching. The comedic animation could be quite good, with fun <a href="https://imgur.com/a/jRpF203">smears</a> and reaction <a href="https://imgur.com/a/NXjcIdT">shots</a>. Most episodes that weren't contributing towards the series plot took the form of a parody, from battle towers, to <a href="https://imgur.com/a/FmEnIuv">Yu-Gi-Oh</a>, to <a href="https://imgur.com/a/rk0hfvS">idols</a>, to <a href="https://imgur.com/a/QRzw0vv">youtubers</a>. And the sense of humor, while usually not my thing, could be amusingly <a href="https://imgur.com/a/I7LjPqS">self-aware</a>, <a href="https://imgur.com/a/bUGsvLg">dark</a>, or over the top.
</p>

<p>
6/10 Most surprisingly well-animated fight scene for episode 7's <a href="https://imgur.com/a/0f4Y4iK">sea battle</a>
</p>
</div>
</div>
</div>
