projects/writing/anime/2022_summer_post/index.org
** William Frederick "Buffalo Bill" Cody
*** Overlord IV
There was politics in this season. And there were fights, I guess. Oh, and there were a bunch of countries. What, that's not just another way to say "politics", it's ... geography or something.

I can't get over that Ains kept going on about how he wants friends or to nurture independence among the Nazarickians, but he can't admit to any shortcomings. Sure, it's comedy at first, but if I'm expected to seriously buy that Ains is lonely or fatherly, I can't also laugh at his glowy, green straight man act.

And I thought the politics were just an extension of that same dichotomy and the fights were kinda ketch' (weak sauce).

4/10 Best dwarf for the dwarf who was willing to straight-up "British Empire" the artifacts of his own peoples' cultural heritage

*** Danmachi IV
I can't get over that this eleven-episode season ended on a cliff-hanger when it felt like there were at least three episodes of unadulterated fluff. At some point in the season, I thought there could be a well-conceived arc to the episodes. We get to see the gang get back together ("Oh, it's wingman." "Oh, it's wingwoman." "Oh, it's 'girl who likes Bell'."), then they get into a sticky situation where the group's reliance on Bell is exposed, but there's a little character development, and finally they get into an even stickier situation but this time the group grows and is able to pull them through it. Welp, maybe next season will be fun.

5/10 Best supporting actress for Aisha's boob cloth (everyone applauds because it should have won a couple seasons ago, but was overshadowed by Hestia's ribbon)

*** MADE IN ABYSS
I was in a state of constant, minor confusion by the different characters' motivations in the city and still don't really understand why Wazukyan and Belaf made a bunch of decisions. But I was still grossed out, sad, and hyped up at the appropriate moments. There were lots of vagina monsters, sorry, hollows. And the climactic battles were exciting. I'd only recently watched the third movie, and the action animation in this series didn't live up to that standard, but it feels unfair to compare a television series and a movie.

8/10 Best fuzzy pink penis character for Maaa

** Charlie Siringo
*** Isekai Ojisan
Well, better luck next season.

*** Lycoris Recoil
Lycoris Recoil isn't really for me, but it was a fun watch. The action scenes were exciting and the relationship between Takina and Chisato was a neat driving force through the season. After establishing their opposing viewpoints on the Lycoris, killing, and underwear, we got to see them grow closer. I would say in a lot of little ways, that closeness was due to Takina changing - not immediately killing everyone, being willing to sacrifice her standing with the Lycoris, taking an interest in the cafe (in ascending order of importance, of course). Not until the very end would I really say Chisato changed, and even that's not really a character change, she was just (spoiler) forced to keep living by Mika and Takina. But whatever, Majima was a more interesting villain than I expected, just as a consequence of questioning the conceit of the show "teenage girls protect Japan by shooting guns".

7/10 Best speculative architecture for the semi-destroyed building that Japan inexplicably decided to preserve as a monument to terrorism? Or as a monument to Chisato saving people? But no, she's a secret, right?

*** Bucchigire!
I dropped this after 10 episodes. It was the last show I was waiting on watching before sending my reviews and I suddenly realized while out on a walk and contemplating anime, "Hey, watch where you're going! Jesus Christ!" And as I crushed that ant below my shoe, the fragility of life and also how much more entertaining non-Bucchigire! shows can be struck me.

In terms of actual critique, the texture that they placed over everything sometimes added to the vibe of the show, but often (especially when placed over a darker scene) looked messy and felt like a ripoff of Odd Taxi's textured look.

Uh, for a show with color-coordinated characters, it was a bit of a weird throwback that the two most prominent (not very prominent) female characters (the girl in the Shinsengumi and the sister of that sheriff from a single episode) were both pink.

*** Warau Arsnotoria Sun--!
This is one of the finest mystery shows of the last decade. In that it is apparently based off of a game, but I never had any idea what kind of game that could be. There are girls, so is it a dating sim? I guess there's "fighting" in the OP and a couple episodes, so it could be some sort of action game? There's music, so it could be a rhythm game. Every episode aludes to some malicious group of "knights" that could storm the school, so maybe tower defense? I still refuse to find out what this game is, because the anime sucked.

I sat through 12 episodes of two characters drinking tea (there are five main characters, but I think of them as only having enough depth for two characters in any self-respecting series), and maddening allusions to some broader story that I never got! I wanted to write that this is the ultimate edging anime, but that is too generous to the term. This is like eternally being an awkward middle schooler who tries to walk past people as they sneeze to get sexual gratification.

Where plot is [[https://imgur.com/a/9sCS237][concerned]]. There is a succession of minor [[https://imgur.com/a/im9exSC][conflicts]] but nothing consequential enough to really matter in subsequent [[https://imgur.com/a/BWlxNxB][episodes]]. What bugs me most is that there are weird moments that slightly raised my expectations over the course of the series. Apart from the obvious "big bad" that was setup throughout, there was a threat to the safety of the girls' school introduced in the first couple episodes that was completely ignored in the remainder, they left the school in one episode and alerted the "big bad" but then *bloop-blap* nothing resulted. Heck, one girl often doesn't "have enough mana for biscuits" and at the end she "has just enough mana". That's probably the only satisfying character arc in the show, and I don't even understand what "mana" is in this world, 'cause it sure as heck isn't being used for exciting magic junk!

Regarding aesthetics, the character designs were obviously too complex for the animators, who are forced to rely on a whole lot of cuts with only a couple frames of movement or just lose any consistency in character models. The backgrounds can be nice, but the direction is very vanilla so this whole magical school campus they were establishing felt stale after a few episodes.

4/10 Cutest domestic servants for the fairies (library, kitchen and miscellaneous)

