projects/writing/anime/2022_summer_post/index.org
*** Yurei Deco
Finally, an anime PSA for kids about the dangers of misinformation and social media. My biggest gripe with the show is that I couldn't get over that comparison and it was hard to look for any deeper meanings (if they existed). But the narrative was well put together (a lot of episodic adventures that fleshed out the detective club members' backstories and fed into the larger mystery of Phantom Zero), the world was fun (a very bleak, utilitarian cityscape underneath kind of tacky glowing shapes), there were some excellent character designs (who doesn't love a business cat?), and moments of squishy, stretchy, shapey animation. Just not as much squishy, stretchy, shapey animation as I was hoping for. I also couldn't get out of my head that if this was a more Yuasa-ish production, the digital worlds would have been way more psychedelic and less like a Bauhaus-loving but window-fearing architect's renderings.

Still, there were good high points, like the digital world in the zoological episode and the search for a mystery ramen stand.

7/10 Best names that I should probably think about the intended meanings of, but just haven't for Tom Sawyer city, Mark Twain, ... Oh, "The Adventures of Huckleberry Finn" -> Hack-Berry-Finn, that's something  at least.

*** KJ File
As far as I can tell, none of this ever got subtitled.

** Theodore Roosevelt + Whatever I didn't write about before the season but ended up watching
*** Hoshi no Samidare
I dropped this after watching the fourth episode, where this little gem of a [[https://imgur.com/a/FKD5aIL][frame]] appeared.

This lowered my opinion of Mizukami Satoshi.

*** Musashino
I guess this is an advertisement for some locality in Japan. And they chose to promote their region in the form of a [[https://imgur.com/a/C0hb9Da][memeworthy]] anime? I wouldn't say this was good, but it was short.

5/10 Best sport for [[https://imgur.com/a/1kqtlGG][UWAAR]]

*** Fuuto Tantei
I gave this one episode but was not into it.

*** Cyberpunk Edgerunners
Wowwie Maui. Now this is how Warau Arsnotoria should have been adapted. I can just imagine those little girls absolutely high out of their minds on Earl Grey jamming scones down each others throats until they burst.

This is basically the peak of the CGDCT* trope. I will never play this game, but gosh darn did this anime make me aware that there is a game called Edgerunners 2069!

Now that I've gotten all that out of the way, time to get down to bras tax. I thought the show did a great job of fitting a satisfying story arc into ten action-packed episodes. I couldn't point out any extraneous scenes or characters and just about every character's decisions and reactions felt justified in the universe's logic**.

The action was pointy, stretchy, colorful, and violent. I enjoyed the few times they would repeat a passage of a battle from several angles. There are a couple choices/scenes that will stay with me for a while:

 - The really superb, Hellboy-esque (or Trigger-esque, but it feels like it's been a while since they've done this kind of dark stuff) shadows during some of the action scenes.

 - (Spoilers) In episode six, the motif of Maine hitting David: Maine's early "Get away from me! Stop bugging me!"-type pushing away, his later "Get a grip! You couldn't handle Tanaka and now we're in deep shit!", and his final sentimental "So long kid" in the psychosis desert. Also, really liked David's shock and grief in the car at the end of the episode, with strong shadows over him.

 - (Spoilers) The whole scene with Doc Ripper in episode eight, from his loopy wiggling fingers animation to his disappointment and sadness as he sits along in the dark apartment at the end.

One bothersome thought I had was that this felt, a little bit in the overall tone but particularly in the music choices, like it was trying to evoke Arcane ('cause Arcane had an Imagine Dragons song and a lot of the music in this series felt similar). Guess I would have preferred something more electronic or jazzy, but plop rock was a choice.

\* Cyberpunk Gangsters Destroying Corporate Toughs.

\** Spoiler: I don't understand if Kiwi turned on Lucy and the gang because she blamed them for Maine and Dorio's deaths or out of greed or something I missed. Her dialogue with Faraday made me think she didn't blame them, but she had such a flat inflection that it was hard to read into her motivations.

8/10 Best counterargument to my preference for shady anime aggregators instead of watching on (in this case) Netflix for the crappy subtitles I watched the first eight episodes with (This might be a 9/10 anime if I'd watched with good subs (Yes, I mean the sandwiches (Yes, I mean the "cruel" definition of "mean" (No, this time I mean the "meaning of" definition of "mean"))))

** ED
Sigh-onara,

Eric
